{"_id":{"$oid":"5ec83f74bf453c22e744df01"},"title":"Grand Theft Auto: San Andreas","genre":1,"clasification":5,"year":2004,"hardware":2,"requirements":3,"description":"Grand Theft Auto: San Andreas is a 2004 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the seventh title in the Grand Theft Auto series, and the followup to the 2002 game Grand Theft Auto: Vice City. It was released in October 2004 for PlayStation 2, and in June 2005 for both Microsoft Windows and Xbox. The game, set within an open world environment that players can explore and interact with at their leisure, focuses on the story of former gangster Carl \"CJ\" Johnson, who is brought back home by the death of his mother, only to become involved in a long journey that sees him exploring the fictional U.S. state of San Andreas, which is heavily based on California and Nevada.[b]  The game features references to many real-life elements of the world, such as its cities, regions, and landmarks, with its plot heavily based on several real-life events in Los Angeles in the early 1990s, including the rivalry between real-life street gangs, the 1980s-early 1990s crack epidemic, the LAPD Rampart scandal, and the 1992 Los Angeles riots. Unlike its predecessor, San Andreas brought with it new elements of gameplay that would be later incorporated in future titles, including RPG-style mechanics, customization options with both clothing and vehicle appearances, a vast array of activities and mini-games, and the inclusion of gambling games.","image":"uploads/2020-05-22T21:09:08.440Z220px-GTASABOX.jpg","__v":0}
{"_id":{"$oid":"5ec83fcabf453c22e744df02"},"title":"Chrono Trigger","genre":5,"clasification":3,"year":1996,"hardware":1,"requirements":2,"description":"Chrono Trigger[a] is a 1995 role-playing video game developed and published by Square for the Super Nintendo Entertainment System that began the Chrono series. Chrono Trigger's development team included three designers that Square dubbed the \"Dream Team\": Hironobu Sakaguchi, the creator of Square's successful Final Fantasy series; Yuji Horii, a freelance designer and creator of Enix's popular Dragon Quest series; and Akira Toriyama, a manga artist famed for his work with Dragon Quest and Dragon Ball. In addition, Kazuhiko Aoki produced the game,[6] Masato Kato wrote most of the story, while composer Yasunori Mitsuda wrote most of the soundtrack before falling ill and deferring the remaining tracks to Final Fantasy series composer Nobuo Uematsu.[3][7] The game's story follows a group of adventurers who travel through time to prevent a global catastrophe.  Chrono Trigger was a critical and commercial success upon release, and is frequently cited as one of the greatest video games of all time. Nintendo Power magazine described aspects of Chrono Trigger as revolutionary, including its multiple endings, plot-related side-quests focusing on character development, unique battle system, and detailed graphics.[8] Chrono Trigger was the third best-selling game of 1995 in Japan,[9] and shipped 2.65 million copies worldwide by March 2003.[10]","image":"uploads/2020-05-22T21:10:34.602ZChrono_Trigger.jpg","__v":0}
{"_id":{"$oid":"5ec84029bf453c22e744df03"},"title":"Super Mario Bros. 3","genre":2,"clasification":1,"year":1988,"hardware":2,"requirements":3,"description":"Super Mario Bros. 3[a] is a platform game developed and published by Nintendo for the Nintendo Entertainment System (NES). It was released in Japan on October 23, 1988, North America on February 12, 1990 and Europe on August 29, 1991. It was developed by Nintendo Entertainment Analysis and Development, led by Shigeru Miyamoto and Takashi Tezuka.  Players control plumbers Mario or Luigi, who must save Princess Toadstool and the rulers of seven different kingdoms from the antagonist Bowser. As in previous Mario games, they defeat enemies by stomping them or using items that bestow magical powers; they also have new abilities, including flight or sliding down slopes. Super Mario Bros. 3 introduces many elements that became Mario series staples, such as Bowser's children (the Koopalings) and a world map to transition between levels.","image":"uploads/2020-05-22T21:12:09.381ZSuper_Mario_Bros._3_coverart.png","__v":0}
{"_id":{"$oid":"5ec8408abf453c22e744df04"},"title":"Nier: Automata","genre":1,"clasification":5,"year":2017,"hardware":2,"requirements":1,"description":"Nier: Automata[b] is a 2017 action role-playing video game developed by PlatinumGames and published by Square Enix. It is a sequel to the 2010 video game Nier, itself a spin-off and sequel of the Drakengard series. The game originally released for the PlayStation 4 and Microsoft Windows via Steam, with an Xbox One port being published the following year.  Set during a proxy war between alien-created machines and human-crafted androids, the story follows the trials of a combat android, her companion, and a fugitive prototype. The story requires multiple playthroughs, each unlocking additional story elements. Gameplay combines role-playing elements with action-based hack and slash combat, and features switches between video game genres similar to that of Nier with elements ranging from shoot 'em up to text adventure.","image":"uploads/2020-05-22T21:13:46.688ZNier_Automata_cover_art.jpg","__v":0}
{"_id":{"$oid":"5ec840cdbf453c22e744df05"},"title":"Grand Theft Auto V","genre":1,"clasification":1,"year":2013,"hardware":1,"requirements":1,"description":"Grand Theft Auto V is a 2013 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the first main entry in the Grand Theft Auto series since 2008's Grand Theft Auto IV. Set within the fictional state of San Andreas, based on Southern California, the single-player story follows three criminals and their efforts to commit heists while under pressure from a government agency and powerful crime figures. The open world design lets players freely roam San Andreas' open countryside and the fictional city of Los Santos, based on Los Angeles.  The game is played from either a third-person or first-person perspective, and its world is navigated on foot or by vehicle. Players control the three lead protagonists throughout single-player and switch among them, both during and outside missions. The story is centred on the heist sequences, and many missions involve shooting and driving gameplay. A \"wanted\" system governs the aggression of law enforcement response to players who commit crimes. Grand Theft Auto Online, the game's online multiplayer mode, lets up to 30 players engage in a variety of different cooperative and competitive game modes.","image":"uploads/2020-05-22T21:14:53.714ZGrand_Theft_Auto_V.png","__v":0}
{"_id":{"$oid":"5ec8411cbf453c22e744df06"},"title":"Crash Bandicoot (video game)","genre":2,"clasification":2,"year":1996,"hardware":2,"requirements":3,"description":"Crash Bandicoot is a platform video game developed by Naughty Dog and published by Sony Computer Entertainment for the PlayStation. The game was released in North America in September 1996, and in Europe in November 1996.  Crash Bandicoot is the first installment in the Crash Bandicoot series, chronicling the creation of the title character at the hands of series antagonist Doctor Neo Cortex and henchman Doctor Nitrus Brio. The story follows Crash as he aims to prevent Brio and Cortex's plans for world domination, and rescue his girlfriend Tawna, a female bandicoot also evolved by Brio and Cortex.  Crash Bandicoot received generally positive reviews from critics, who praised the game's graphics and unique visual style, but criticized its controls and lack of innovation as a platform game. The game went on to sell over 6 million units, making it the eighth best-selling PlayStation game of all time,[1] and the highest selling ranked on sales in the United States.[2] A remastered version, included in the Crash Bandicoot N. Sane Trilogy collection, was released for the PlayStation 4 in June 2017, and ported to other platforms the following year.","image":"uploads/2020-05-22T21:17:10.283Z220px-Crash_Bandicoot_Cover.png","__v":0}
{"_id":{"$oid":"5ec8419fbf453c22e744df07"},"title":"Darksiders","genre":2,"clasification":5,"year":2010,"hardware":1,"requirements":1,"description":"The first installment in the franchise, Darksiders was released in 2010 for PlayStation 3, Xbox 360, and Microsoft Windows. Originally set in a modern-day Earth, a war breaks out between Heaven and Hell. War, one of the Four Horsemen of the Apocalypse, finds himself on Earth in the midst of the battle. After War is killed in the battle, the Charred Council blame him for destroying the balance and starting the apocalypse. War vows to find the one truly responsible, so he is sent back to Earth, where 100 years have passed, in his search to find them.  An enhanced version, titled Darksiders: Warmastered Edition, published by Nordic Games, was released on November 22, 2016 for PlayStation 4 and Xbox One, on November 29 for Microsoft Windows, and on May 23, 2017 for Wii U.[1] It was released on Nintendo Switch on April 2, 2019.[2]","image":"uploads/2020-05-22T21:18:23.918ZDarksiders_New_Box_Art.jpg","__v":0}
{"_id":{"$oid":"5ec8430bbf453c22e744df08"},"title":"Pirates of the Caribbean (video game)","genre":1,"clasification":5,"year":2003,"hardware":2,"requirements":3,"description":"irates of the Caribbean is an action role-playing game in which the player, as Captain Nathaniel Hawk, goes on a series of quests for any one of the countries that control the islands of the Caribbean in the 17th Century. The player can buy new ships, recruit a crew and hire officers who will follow Hawk on his quest and help him in battle. The game features gameplay that takes place both on land and at sea, and allows the player to upgrade their character by earning skill points and gain new abilities.  The game was originally developed under the name Sea Dogs II, and was to be the sequel to Sea Dogs, which was released in 2000. Apart from the pirate theme, the setting and the presence of the Black Pearl, the game otherwise has few connections to the Pirates of the Caribbean: The Curse of the Black Pearl film, which was released around the same time as the game.[1]  The PC version of this game is one of the first video games with multi-threaded code that is optimized for the Intel's Hyper-Threading technology.","image":"uploads/2020-05-22T21:24:27.480ZPirates_of_the_Caribbean_-_video_game_cover.png","__v":0}
{"_id":{"$oid":"5ec8444934e44d311c2b3726"},"title":"Age of Empires","genre":5,"clasification":4,"year":1997,"hardware":2,"requirements":3,"description":"Age of Empires is a series of historical real-time strategy video games, originally developed by Ensemble Studios and published by Xbox Game Studios. The first game of the series was Age of Empires, released in 1997. Seven other games and three spin-offs have been released.  Age of Empires focused on events in Europe, Africa and Asia, spanning from the Stone Age to the Iron Age; the expansion game explored the formation and expansion of the Roman Empire. The sequel, Age of Empires II: The Age of Kings, was set in the Middle Ages, while its expansion focused partially on the Spanish conquest of Mexico. The subsequent three games of Age of Empires III explored the early modern period, when Europe was colonizing the Americas and several Asian nations were on the decline. The newest installment, Age of Empires Online, takes a different approach as a free-to-play online game utilizing Games for Windows Live. A spin-off game, Age of Mythology, was set in the same period as the original Age of Empires, but focused on mythological elements of Greek, Egyptian, and Norse mythology. A fourth main installment in the series, Age of Empires IV, is under development.  The Age of Empires series has been a commercial success, selling over 25 million copies. Critics have credited part of the success of the series to its historical theme and fair play; the artificial intelligence (AI) players have fewer advantages than in many of the series' competitors.","image":"uploads/2020-05-22T21:29:45.129Zage-of-empires-definitive-edition-windows-10-cover.jpg","__v":0}
